package com.javarush.test.level03.lesson06.task03;

/* Семь цветов радуги
Выведи на экран текст - семь цветов радуги.
В каждой строке должно быть по три цвета, в последней - один.
Цвета в строках разделяй пробелом.
Запомни: буквы Ё в тестах нигде нет.
Чтобы тесты проходили правильно, во всех задачах заменяй Ё на Е.
*/

public class Solution
{
    public static void main(String[] args)
    {
        //Напишите тут ваш код
        System.out.print("Красный" + " " + "Оранжевый" + " " + "Желтый" + "\n");
        System.out.print("Зеленый" + " " + "Голубой" + " " + "Синий" + "\n");
        System.out.print("Фиолетовый");
    }
}